Catalogs/АР_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>АР_Тарифы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕденицаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_НазваниеРесурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/АР_Тарифы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_Тарифы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕденицаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НазваниеРесурса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_НазваниеРесурса</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/АР_Тарифы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР_ТарифыСрезПоследних.Тариф,
	               |	АР_ТарифыСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.АР_Тарифы.СрезПоследних(
	               |			&Период,
	               |			НазваниеРесурса = &НазваниеРесурса
	               |				И ОбъектАренды = &ОбъектАренды) КАК АР_ТарифыСрезПоследних";
				   
	Запрос.УстановитьПараметр("Период",ТекущаяДата());			   
	Запрос.УстановитьПараметр("НазваниеРесурса",Объект.НазваниеРесурса);
	Запрос.УстановитьПараметр("ОбъектАренды",Объект.ОбъектАренды);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Объект.Дата = Выборка.Период;
		Объект.Тариф = Выборка.Тариф;
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
    НаборЗаписей = РегистрыСведений.АР_Тарифы.СоздатьНаборЗаписей();
    НаборЗаписей.Отбор.НазваниеРесурса.Установить(Объект.НазваниеРесурса);
    НаборЗаписей.Отбор.ОбъектАренды.Установить(Объект.ОбъектАренды);
    НаборЗаписей.Отбор.Период.Установить(Объект.Дата);
    НаборЗаписей.Прочитать();
 
    Если НаборЗаписей.Количество() = 0 Тогда
        НоваяЗапись = НаборЗаписей.Добавить();
        //НоваяЗапись.Валюта = СсылкаНаВалюту;
        НоваяЗапись.Период = ТекущаяДата();
    ИначеЕсли НаборЗаписей.Количество() = 1 Тогда
        НоваяЗапись = НаборЗаписей[0];
    КонецЕсли;
 
    НоваяЗапись.Период = Объект.Дата;
	НоваяЗапись.Тариф = Объект.Тариф;
    НоваяЗапись.ОбъектАренды = Объект.ОбъектАренды;
	НоваяЗапись.НазваниеРесурса = Объект.НазваниеРесурса;
	
    НаборЗаписей.Записать();	
	
КонецПроцедуры
